Repository: FauxFaux/slashtime
Catalog: po/*.po
Languages: fr_ca

source: Find a meeting time
fr_ca: Trouvez un temps de réunion

source: Set the time at:
fr_ca: Mettez le temps à:

source: to:
fr_ca: à

source: Click on a city to change location
fr_ca: Clic sur une ville pour changer l'endroit

source: Universal Time, Co-ordinated
fr_ca: Temps Universel Coordonné

source: Meeting...
fr_ca: Réunion...

source: Pop up the Meeting planner
fr_ca: Levez une dialog le planificateur de réunions

source: Show the time in various places!
fr_ca: Montrez le temps dans divers endroits!

source: Copyright
fr_ca: Droits de auteur

source: and Others
fr_ca: et d'autres
